
package Loop.src;

import java.util.Scanner;


public class Loop {
    public static void main(String[] args) {
	    
	    
	    
	    int i=1;
	    while(i<=16)//لطباعة المتسلسلة 4,6,8,10,12,14,16
	    {
	        System.out.print(i+",");
	        i+=2;
	    }
	    System.out.println("\b\b");//لحذف المسافة والفاصلة بعد آخر رقم وينزل سطر 
	    //===============================================================================================================
	    int x=1;
	    while(x<=100)//لطباعة الأعداد الزوجية
	    {
	        if(x%2==0){
	            System.out.println(x);
	        }
	        x++;
	    } 
	    
	    //===============================================================================================================
	    int y=1;
	    while(y<=100)//لطباعة الأعداد الفردية
	    {
	        if(y%2!=0){
	            System.out.println(y);
	        }
	        y++;
	    }
	    //===============================================================================================================
	   Scanner in=new Scanner (System.in);
	    System.out.print("Enter The Number : ");
	    int n=in.nextInt();
	    int X=1;
	    do{
	        if(X%2!=0)//لطباعة الاعداد الفردية من واحد حتى الرقم الذي أدخله المستخدم
	        System.out.println(X);
	        X++;
	    }while(X<=n);
	    //===============================================================================================================
	    for(int B=1;B<=12;B++){
	        if(B==n)
	            continue;//  وينتقل لنهاية الحلقة ثم ينفذ المرحلة التالية ينتقل لتحديث ifلتجاوز وتخطي المرحلة وعدم تنفيذها عند تحقق شرط ال
	        System.out.println(B+"*"+n+"= "+(B*n));
	    }
	    //===============================================================================================================
	    for(int B=1;B<=12;B++){
	        if(B==n)
	            break;//عند تحقق الشرط يوقف الحلقة بالكامل ولا يحدث ينتقل لما بعد الحلقة
	        System.out.println(B+"*"+n+"= "+(B*n));
	    }
	    System.out.println("Deema");
	    //===============================================================================================================
	    for(int C=1;C<=9;C++){//nested Loop لطباعة جدول الضرب
	        for(int Z=1;Z<=12;Z++){
	            System.out.println(C+"*"+Z+" = "+(C*Z));
	        }
	    }
	    //===============================================================================================================
	   for(int W=1;W<=8;W++){//nested Loop لطباعة هرم نجوم
	        for(int V=1;V<=W;V++){
	            System.out.print("*");
	        }
	       System.out.println(" ");//لينزل سطر بعد كل لفة
	    }
	    //===============================================================================================================
	  
	    
	    
	    
	    
	    
	    
	}
    
}
